#!/bin/bash

# تعریف رنگ‌ها
red='\033[0;31m'
bblue='\033[0;34m'
yellow='\033[0;33m'
green='\033[0;32m'
plain='\033[0m'

# توابع برای نمایش متن رنگی
red() { echo -e "\033[31m\033[01m$1\033[0m"; }
green() { echo -e "\033[32m\033[01m$1\033[0m"; }
yellow() { echo -e "\033[33m\033[01m$1\033[0m"; }
blue() { echo -e "\033[36m\033[01m$1\033[0m"; }
white() { echo -e "\033[37m\033[01m$1\033[0m"; }
bblue() { echo -e "\033[34m\033[01m$1\033[0m"; }
rred() { echo -e "\033[35m\033[01m$1\033[0m"; }
readtp() { read -t5 -n26 -p "$(yellow "$1")" $2; }
readp() { read -p "$(yellow "$1")" $2; }

# ----------------------------------------نمایش منو اصلی------------------------------------------------
display_main_menu() {
    clear 
    echo
    echo
    bblue "                 ███╗   ███╗███████╗██╗  ██╗██████╗ ██╗                  "
    bblue "                 ████╗ ████║██╔════╝██║  ██║██╔══██╗██║                 "
    bblue "                 ██╔████╔██║█████╗  ███████║██████╔╝██║                 "
    bblue "                 ██║╚██╔╝██║██╔══╝  ██╔══██║██╔═══╝ ██║                "
    bblue "                 ██║ ╚═╝ ██║███████╗██║  ██║██║     ██║                 "
    bblue "                 ╚═╝     ╚═╝╚══════╝╚═╝  ╚═╝╚═╝     ╚═╝                 "
    white "------------------------------------------------------------------"
    white " Telegram: https://t.me/m3hdiclubsupport"
    echo
    echo
    yellow "-----------------INSTALL----------------------------"
    echo
    green "1. UPDATE                2. UPDATE2"
    echo
    yellow "--------------------Panels-----------------------------"
    echo
    green "3. S-UI                  4. H-UI"
    echo
    green "5. X-UI [3x]                  6. X-UI [alireza]"
    echo
    rred "0. Exit"
    echo "------------------------------------------------------"
}

# فراخوانی تابع نمایش منو اصلی
display_main_menu
